# User Based Recommender System

In [1]:
import pandas as pd

In [4]:
ratings=pd.read_csv("ml-100k/u.data",sep="\t",header=None,names=['user_id','movie_id','rating'],usecols=range(3))
#comma seperated values

In [5]:
ratings.head()

   user_id  movie_id  rating
0      196       242       3
1      186       302       3
2       22       377       1
3      244        51       2
4      166       346       1

In [6]:
range(3)

range(0, 3)

In [7]:
movies=pd.read_csv("ml-100k/u.item",sep="|",header=None,encoding="iso-8859-1",names=['movie_id','title'],usecols=range(2))

In [8]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [9]:
ratings=pd.merge(movies,ratings)

In [10]:
ratings.head()

   movie_id             title  user_id  rating
0         1  Toy Story (1995)      308       4
1         1  Toy Story (1995)      287       5
2         1  Toy Story (1995)      148       4
3         1  Toy Story (1995)      280       4
4         1  Toy Story (1995)       66       3

In [11]:
ratings.title.nunique()

1664

In [12]:
import numpy as np

In [13]:
#Matrix Factorization

In [14]:
movieratings=ratings.pivot_table(index=["user_id"],columns=["title"],values="rating")

In [15]:
movieratings.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,2.0,NaN,NaN,NaN,NaN,4.0,NaN,NaN,...,NaN,NaN,NaN,4.0,NaN,NaN,NaN,NaN,4.0,NaN

In [16]:
starwars=movieratings["Star Wars (1977)"]

In [ ]:
grouped=ratings.groupby("title").agg({"rating":[np.size,np.sum,np.mean]})

In [ ]:
grouped.head()

In [ ]:
populer=grouped.sort_values(("rating","mean"),ascending=False)

In [ ]:
populer.head()

In [ ]:
toplam=grouped["rating"]["sum"].sum()

In [ ]:
toplam

In [ ]:
populer["percentage"]=populer["rating","sum"].div(toplam)*100

In [ ]:
populer.head()

In [ ]:
populer.sort_values(("percentage"),ascending=False)